# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [226]:
import pandas as pd

# Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [227]:
# code from Google
import zipfile


with zipfile.ZipFile("Data.zip","r") as zip_ref:
    zip_ref.extractall("Data")

In [228]:
from os import listdir

arrInfo = []
arrMarks = []

for file in listdir("./Data/Data"):
    tmp = pd.read_csv("./Data/Data/" + file)
    if "marks" in file:
        arrMarks.append(tmp)
    else:
        arrInfo.append(tmp) 
    
DataFrameInfo = pd.concat(arrInfo)
DataFrameMarks = pd.concat(arrMarks)

df = DataFrameInfo.merge(DataFrameMarks, on='index', sort=True)

df.head(10)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75
5,5,female,group B,associate's degree,standard,none,group1,71,83,78
6,6,female,group B,some college,standard,completed,group1,88,95,92
7,7,male,group B,some college,free/reduced,none,group1,40,43,39
8,8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [229]:
df = df.drop("index", axis=1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [230]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [231]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [232]:
df.isnull().sum()

# missed values are not found

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [233]:
print(df["math score"].mean())
print(df["reading score"].mean()) 
print(df["writing score"].mean())

66.089
69.169
68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [234]:
print(df.groupby('test preparation course')['math score'].mean())
print(df.groupby('test preparation course')['reading score'].mean())
print(df.groupby('test preparation course')['writing score'].mean())

test preparation course
completed    69.695531
none         64.077882
Name: math score, dtype: float64
test preparation course
completed    73.893855
none         66.534268
Name: reading score, dtype: float64
test preparation course
completed    74.418994
none         64.504673
Name: writing score, dtype: float64

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [235]:
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [236]:
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})
df.head(10)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

**Зафиксируем минимальный балл для сдачи экзамена**

In [237]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [238]:
print((df['math score'] >= passmark).sum() / df.shape[0])
print(((df['math score'] >= passmark) & (df['test preparation'] == 'completed')).sum() / (df['test preparation'] == 'completed').sum())
print(((df['gender'] == 'female') & (df['test preparation'] == 'none') & (df['math score'] < passmark)).sum() / (df['test preparation'] == 'none').sum())

0.865
0.9217877094972067
0.10903426791277258

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [239]:
import time
start_time = time.time()
print(df.groupby('race/ethnicity')['reading score'].mean())
print("Time execution for the first task:", time.time() - start_time)
start_time_second = time.time()
print(df.groupby('education')['writing score'].min())
print("Time execution for the second task:", time.time() - start_time_second)

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
Time execution for the first task: 0.004114866256713867
education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
Time execution for the second task: 0.004004716873168945

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [254]:
import time 

start_time = time.time()

# df['race/ethnicity'].unique()
arrA = []
arrB = []
arrC = []
arrD = []
arrE = []

for (i, row) in df.iterrows():
    if (row["race/ethnicity"] == 'group A'):
        arrA.append(row["reading score"])
    elif (row["race/ethnicity"] == 'group B'):
        arrB.append(row["reading score"])
    elif (row["race/ethnicity"] == 'group C'):
        arrC.append(row["reading score"])
    elif (row["race/ethnicity"] == 'group D'):
        arrD.append(row["reading score"])
    elif (row["race/ethnicity"] == 'group E'):
        arrE.append(row["reading score"])

print(sum(arrA) / len(arrA))
print(sum(arrB) / len(arrB))
print(sum(arrC) / len(arrC))
print(sum(arrD) / len(arrD))
print(sum(arrE) / len(arrE))

print("Time execution for the first task:", time.time() - start_time)

start_time_second = time.time()

# df['education'].unique()
minBD = minSC = minMD = minAD = minHS = minSHS = 101

for (i, row) in df.iterrows():
    if (row["education"] == "bachelor's degree"):
        if row["writing score"] < minBD:
            minBD = row["writing score"]
    elif (row["education"] == 'some college'):
        if row["writing score"] < minSC:
            minSC = row["writing score"]
    elif (row["education"] == "master's degree"):
        if row["writing score"] < minMD:
            minMD = row["writing score"]
    elif (row["education"] == "associate's degree"):
        if row["writing score"] < minAD:
            minAD = row["writing score"]
    elif (row["education"] == 'high school'):
        if row["writing score"] < minHS:
            minHS = row["writing score"]
    elif (row["education"] == 'some high school'):
        if row["writing score"] < minSHS:
            minSHS = row["writing score"]

print(minAD)            
print(minBD)
print(minHS)
print(minMD)
print(minSC)
print(minSHS)

print("Time execution for the second task:", time.time() - start_time_second)

64.67415730337079
67.35263157894737
69.10344827586206
70.03053435114504
73.02857142857142
Time execution for the first task: 0.11205697059631348
35
38
15
46
19
10
Time execution for the second task: 0.07881498336791992

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [264]:
grouped = pd.pivot_table(data=df,index=['education', 'gender'])
grouped

                           math score  reading score  writing score
education          gender
associate's degree female   65.250000      74.120690      74.000000
                   male     70.764151      67.433962      65.405660
bachelor's degree  female   68.349206      77.285714      78.380952
                   male     70.581818      68.090909      67.654545
high school        female   59.351064      68.202128      66.691489
                   male     64.705882      61.480392      58.539216
master's degree    female   66.500000      76.805556      77.638889
                   male     74.826087      73.130435      72.608696
some college       female   65.406780      73.550847      74.050847
                   male     69.009259      64.990741      63.148148
some high school   female   59.296703      69.109890      68.285714
                   male     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [281]:
def func(x):
    if x >= passmark:
        return 'P'
    else:
        return 'F'
    
df["Reading_PassStatus"] = df["reading score"].apply(lambda x: func(x))
df["Writing_PassStatus"] = df["writing score"].apply(lambda x: func(x))

print("Math passed:",(df["Math_PassStatus"] == "P").sum())
print("Math failed:",(df["Math_PassStatus"] == "F").sum())
print("Reading passed:",(df["Reading_PassStatus"] == "P").sum())
print("Reading failed:",(df["Reading_PassStatus"] == "F").sum())
print("Writing passed:",(df["Writing_PassStatus"] == "P").sum())
print("Writing failed:",(df["Writing_PassStatus"] == "F").sum())

Math passed: 865
Math failed: 135
Reading passed: 910
Reading failed: 90
Writing passed: 886
Writing failed: 114

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [289]:
def func(x, y, z):
    if x or y or z == "F":
        return "F"
    else:
        return "P"

arr = []

for (i, row) in df.iterrows():
    if ((row["Math_PassStatus"] == "F") or (row["Reading_PassStatus"] == "F") or (row["Writing_PassStatus"] == "F")):
        arr.append("F")
    else:
        arr.append("P")
        
df['OverAll_PassStatus'] = arr

print("Exams passed:",(df["OverAll_PassStatus"] == "P").sum())

Exams passed: 812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [300]:
def GetGrade(average_mark):
    if average_mark >= 90:
        return "A"
    elif average_mark >= 80:
        return "B"
    elif average_mark >= 70:
        return "C"
    elif average_mark >= 60:
        return "D"
    elif average_mark >= 50:
        return "E"
    else:
        return "F"

arr = []
    
for (i, row) in df.iterrows():
    average_mark = (int(row["math score"]) + int(row["reading score"]) + int(row["writing score"]))/3
    arr.append(GetGrade(average_mark))

df['Grade'] = arr

print("A:",(df["Grade"] == "A").sum())
print("B:",(df["Grade"] == "B").sum())
print("C:",(df["Grade"] == "C").sum())
print("D:",(df["Grade"] == "D").sum())
print("E:",(df["Grade"] == "E").sum())
print("F:",(df["Grade"] == "F").sum())

A: 52
B: 146
C: 261
D: 256
E: 182
F: 103